# ReferenceOffset Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
NumberSystem..::..ReferenceOffset Property
NumberSystem Class See Also
---
The offset to the reference curve.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public double ReferenceOffset { get; set; }
```

Visual Basic
---
```text
Public Property ReferenceOffset As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double ReferenceOffset {
	double get ();
	void set (double value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: The given value for referenceOffset must be no more than 30000 feet in absolute value. |

# See Also
NumberSystem Class
Autodesk.Revit.DB Namespace